Repository: yellow-factory/naples
Catalog: lib/l10n/intl_*.arb
Languages: ca, es

# numberMax
source: Please enter a number lower than {max}
ca: Introdueix un nombre inferior a {max}.
es: Introduce un número inferior a {max}

# numberMin
source: Please enter a number greater than {min}.
ca: Introdueix un nombre major de {min}.
es: Introduce un número superior a {min}.

# numberNegative
source: Please enter a negative number
ca: Introdueix un nombre negatiu.
es: Introduce un número negativo.

# numberPositive
source: Please enter a positive number
ca: Introdueix un nombre positiu.
es: Introduce un número positivo.

# numberRange
source: Please enter a number between {min} and {max}.
ca: Introdueix un nombre entre {min} i {max}.
es: Introduce un número entre {min} i {max}.

# numberRequired
source: Please enter some number different than zero
ca: Introdueix un número diferent de zero.
es: Introduce un número diferente de cero.

# required
source: Please enter some text
ca: El camp és obligatori.
es: El campo es obligatorio.

# stringMaxLength
source: Max length cannot be greater than {max}
ca: La llargada del text no pot ser major de {max} caràcters.
es: El texto no puede tener más de {max} carácteres.

# stringMinLength
source: Minimum length cannot be lower than $min
ca: La llargada del text no pot ser menor de {min} caràcters.
es: El texto no puede tener menos de {min} carácteres.

# stringRegularExpression
source: Is not matching the regular expression: $expression
ca: El text no segueix l'expressió regular: $expression
es: El texto no cumple con la expresión regular {expression}.

# stringRequired
source: Please enter some text
ca: Introdueix un text.
es: Introduce un texto.
